jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
    switch (evt_type)
    {
        case BLE_TMS_EVT_NOTIF_TAP:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_TAP - %d\r\n", p_tms->is_tap_notif_enabled);
            // if (p_tms->is_tap_notif_enabled)
            // {
            //     err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_TAP);
            //     APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_TAP);
            //     APP_ERROR_CHECK(err_code);
            // }
            break;

        case BLE_TMS_EVT_NOTIF_ADC:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_ADC - %d\r\n", p_tms->is_adc_notif_enabled);
            // if (p_tms->is_orientation_notif_enabled)
            // {
            //     imu.quat6_enabled = 1;
                
            //     // err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_ORIENTATION);
            //     // APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     imu.quat6_enabled = 0;

            //     // err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_ORIENTATION);
            //     // APP_ERROR_CHECK(err_code);
            // }

            // // Pass change IMU settings to event handler
            // err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
            // APP_ERROR_CHECK(err_code);
            break;

        case BLE_TMS_EVT_NOTIF_QUAT:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_QUAT - %d\r\n", p_tms->is_quat_notif_enabled);
            // if (p_tms->is_quat_notif_enabled)
            // {
            //     imu.quat6_enabled = 1;
                
            //     // err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_QUAT);
            //     // APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     imu.quat6_enabled = 0;

            //     // err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_QUAT);
            //     // APP_ERROR_CHECK(err_code);
            // }

            // // Pass change IMU settings to event handler
            // err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
            // APP_ERROR_CHECK(err_code);

            break;

        case BLE_TMS_EVT_NOTIF_PEDOMETER:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_PEDOMETER - %d\r\n", p_tms->is_pedo_notif_enabled);
            // if (p_tms->is_pedo_notif_enabled)
            // {
            //     err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_PEDOMETER);
            //     APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_PEDOMETER);
            //     APP_ERROR_CHECK(err_code);
            // }
            break;

        case BLE_TMS_EVT_NOTIF_RAW:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_RAW - %d\r\n", p_tms->is_raw_notif_enabled);
            // if (p_tms->is_raw_notif_enabled)
            // {
            //     imu.gyro_enabled = 1;
            //     imu.accel_enabled = 1;
            //     imu.mag_enabled = 1;
            //     // err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_RAW);
            //     // APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     imu.gyro_enabled = 0;
            //     imu.accel_enabled = 0;
            //     imu.mag_enabled = 0;
            //     // err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_RAW);
            //     // APP_ERROR_CHECK(err_code);
            // }

            // // Pass change IMU settings to event handler
            // err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
            // APP_ERROR_CHECK(err_code);

            break;

        case BLE_TMS_EVT_NOTIF_EULER:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_EULER - %d\r\n", p_tms->is_euler_notif_enabled);
            // if (p_tms->is_euler_notif_enabled)
            // {
            //     imu.euler_enabled = 1;
            //     // err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_EULER);
            //     // APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     imu.euler_enabled = 0;
            //     // err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_EULER);
            //     // APP_ERROR_CHECK(err_code);
            // }

            // // Pass change IMU settings to event handler
            // err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
            // APP_ERROR_CHECK(err_code);

            break;

        case BLE_TMS_EVT_NOTIF_ROT_MAT:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_ROT_MAT - %d\r\n", p_tms->is_rot_mat_notif_enabled);
            // if (p_tms->is_rot_mat_notif_enabled)
            // {
            //     err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_ROT_MAT);
            //     APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_ROT_MAT);
            //     APP_ERROR_CHECK(err_code);
            // }
            break;

        case BLE_TMS_EVT_NOTIF_HEADING:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_HEADING - %d\r\n", p_tms->is_heading_notif_enabled);
            // if (p_tms->is_heading_notif_enabled)
            // {
            //     err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_HEADING);
            //     APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_HEADING);
            //     APP_ERROR_CHECK(err_code);
            // }
            break;

        case BLE_TMS_EVT_NOTIF_GRAVITY:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_GRAVITY - %d\r\n", p_tms->is_gravity_notif_enabled);
            // if (p_tms->is_gravity_notif_enabled)
            // {
            //     err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_GRAVITY_VECTOR);
            //     APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_GRAVITY_VECTOR);
            //     APP_ERROR_CHECK(err_code);
            // }
            break;

        case BLE_TMS_EVT_CONFIG_RECEIVED:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_CONFIG_RECEIVED - %d\r\n", length);
            APP_ERROR_CHECK_BOOL(length == sizeof(ble_tms_config_t));

            ble_tms_config_t received_config;
            memcpy(&received_config, p_data, length);

            NRF_LOG_INFO("FREQUENCY %d Hz", received_config.motion_freq_hz);

            imu.gyro_enabled = received_config.gyro_enabled;
            imu.accel_enabled = received_config.accel_enabled;
            imu.mag_enabled = received_config.mag_enabled;
            imu.quat6_enabled = received_config.quat6_enabled;
            imu.quat9_enabled = received_config.quat9_enabled;
            imu.euler_enabled = received_config.euler_enabled;
            if(received_config.motion_freq_hz != 0) imu.period = FREQ_TO_MS(received_config.motion_freq_hz);
            imu.sync = received_config.sync_enabled;
            imu.stop = received_config.stop;
            imu.adc = received_config.adc_enabled;
            imu.sync_start_time = received_config.sync_start_time;

            // Stop syncing
            m_imu_trigger_enabled = imu.sync;

            NRF_LOG_INFO("received_config.motion_freq_hz %d", received_config.motion_freq_hz);
            NRF_LOG_INFO("imu.period %d", imu.period);
            NRF_LOG_INFO("ADC received config: %d", received_config.adc_enabled);
            NRF_LOG_INFO("ADC: %d", imu.adc);

