jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // CHANGES
    // Configure BLE buffer: store more packets than usable in one connection interval in BLE buffer.
    ble_cfg_t ble_cfg;

    memset(&ble_cfg, 0, sizeof ble_cfg);
    ble_cfg.conn_cfg.conn_cfg_tag                     = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.gatts_conn_cfg.hvn_tx_queue_size = 20;              // Change hvn_tx_queue_size to 20: now we have the ability to queue up to 20 packets
    err_code = sd_ble_cfg_set(BLE_CONN_CFG_GATTS, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("sd_ble_cfg_set err_code: %d", err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
		
		// Added//
		if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        NRF_LOG_INFO("MTU size is set to 0x%X(%d)", p_evt->params.att_mtu_effective, p_evt->params.att_mtu_effective);
    }

    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED))
    {
         NRF_LOG_INFO("LL packet size is set to %d", p_gatt->data_length);
    }
}


/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE); // 247 max size
    APP_ERROR_CHECK(err_code);
}



// static void ts_gpio_trigger_enable(void)
// {
//     uint64_t time_now_ticks;
//     uint32_t time_now_msec;
//     uint32_t time_target;
//     uint32_t err_code;

//     if (m_gpio_trigger_enabled)
//     {
//         return;
//     }

//     // Round up to nearest second to next 2000 ms to start toggling.
//     // If the receiver has received a valid sync packet within this time, the GPIO toggling polarity will be the same.

//     time_now_ticks = ts_timestamp_get_ticks_u64();
//     time_now_msec = TIME_SYNC_TIMESTAMP_TO_USEC(time_now_ticks) / 1000;

//     time_target = TIME_SYNC_MSEC_TO_TICK(time_now_msec) + (2000 * 2);
//     time_target = (time_target / 2000) * 2000;

//     err_code = ts_set_trigger(time_target, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
//     APP_ERROR_CHECK(err_code);

//     nrf_gpiote_task_set(NRF_GPIOTE_TASKS_CLR_3);

//     m_gpio_trigger_enabled = true;
// }

// static void ts_gpio_trigger_disable(void)
// {
//     m_gpio_trigger_enabled = false;
// }


void ts_imu_trigger_enable(void)
{
    NRF_LOG_INFO("ts_imu_trigger_enable()");

    uint64_t time_now_ticks;
    uint32_t time_now_msec;
    uint32_t time_target;
    uint32_t err_code;

    if (m_imu_trigger_enabled)
    {
        return;
    }

    // Round up to nearest second to next 2000 ms to start toggling.
    // If the receiver has received a valid sync packet within this time, the GPIO toggling polarity will be the same.
    // If Sync packet is received within this timestamp - the peripherals will trigger at the same time.

    time_now_ticks = ts_timestamp_get_ticks_u64();
    time_now_msec = TIME_SYNC_TIMESTAMP_TO_USEC(time_now_ticks) / 1000;

    time_target = TIME_SYNC_MSEC_TO_TICK(time_now_msec) + (2000 * 2);
    time_target = (time_target / 2000) * 2000;

    err_code = ts_set_trigger(time_target, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
    APP_ERROR_CHECK(err_code);

    nrf_gpiote_task_set(NRF_GPIOTE_TASKS_CLR_3);

    m_imu_trigger_enabled = true;
}

static void ts_imu_trigger_disable(void)
{
    NRF_LOG_INFO("ts_imu_trigger_disable()");
    m_imu_trigger_enabled = false;
}

void timesync_pin_toggle(uint32_t tick)
{
    // NRF_LOG_INFO("tick_target:  %d", tick_target);
    if( (tick % 100) == 0)
    {
        // NRF_LOG_INFO("Multiple of 100 ticks detected");
        nrf_gpio_pin_toggle(TIMESYNC_PIN);
        // NRF_LOG_INFO("Sync pin toggle");
    }
}


static void ts_evt_synchronized_enable()
{
    m_ts_synchronized = 1;
}

static void ts_evt_synchronized_disable()
{
    m_ts_synchronized = 0;
}

static bool ts_evt_synchronized()
{
    return m_ts_synchronized;
}




static void ts_evt_callback(const ts_evt_t* evt)
{
    // NRF_LOG_INFO("ts_evt_callback");

    APP_ERROR_CHECK_BOOL(evt != NULL);

    switch (evt->type)
    {
        case TS_EVT_SYNCHRONIZED:
            NRF_LOG_INFO("TS_EVT_SYNCHRONIZED");
            // ts_imu_trigger_enable();
            ts_evt_synchronized_enable();
            break;
        case TS_EVT_DESYNCHRONIZED:
            NRF_LOG_INFO("TS_EVT_DESYNCHRONIZED");
            ts_imu_trigger_disable();
            ts_evt_synchronized_disable();
            break;
        case TS_EVT_TRIGGERED:
            // NRF_LOG_INFO("TS_EVT_TRIGGERED");
            {
                uint32_t tick_target;

